{
  "id": 1598,
  "type": "artist",
  "handle": "Yerzmyey",
  "location": "Kraków",
  "country": "pl",
  "info": "I started to make chiptunes on ZX Spectrum computer, in 1989. ZX Spectrum 48K has 1-bit sound by default, but one can also connect an AY-interface to the machine (existing since its very beginning in 1982 and even earlier because first AY-interfaces have been built for ZX81 computer - 1981).\n\nAnyway - then Spectrum48 has the same sound-abilities what Spectrum128, Amstrad CPC, Atari ST or MSX have (they use the same chip standard: AY/YM). It means 4-bit sound, 3 channels + white noise generator, square wave and several 'buzzers'. Or - instead of it - I can use 3 channels of 4-bit digital sound with the AY, but then I have to fit all samples in 48Kb of RAM. :)\n\nIn case of chip-music, as \"standard capabilities\" I understand AY/YM working in 50hz (Atari ST can use this chip with 200hz of speed which gives the Atarians better audio effects due to their more powerful CPU - 16-bit, 8MHz. Cry cry!!).\nSo that's my weapon of choice: ZX Spectrum 48K with AY-interface.\n\nFor making chiptunes I use ZX Spectrum's Sound-Tracker 1.1 and for digital MOD-like music I use SampleTracker 2.0 and 2.1.\n\nIn 1994 I started to make music also for Amiga 500 (MOD / MED files) on OctaMED, but they were 4 channels traxx mostly - in 99%. :) We made only several 8 channels tracks on OctaMED but it was pretty hard task for old good A500, so usually I stick with 4ch. :)\n\nIn 2002 I founded AY-RIDERS band. We play chiptunes on our Spectrums (48K, 128K and higher models). AY-RIDERS' music can be found here: ay-riders.speccy.cz/ (My own music You can find here: yerzmyey.i-demo.pl/ ).\n\nSome time later I started to make more music for Atari ST and STe (mostly digital, but also some chiptunes).\nThat's how the YM-DIGITAL band appeared in 2010: ym-digital.i-demo.pl/ - there are 2 albums for all enthusiasts of ym2149 chip and digital oldschool music.\n\nIn 2012 I bought an Amiga 1200 and was able to start making full 8-channels digital songs for the platform (with independent volumes). That's how the \"RetroBeat\" album appeared, for all fans of Amiga, and also for fans of retro-computer-music.\n\nFrom time to time I make songs for Atari Falcon 030 (10 channels of digital music, on DHS-Tracker).\n\nIn 2015 I bought a British microcomputer Raspberry Pi 2 (smaller than the human hand-palm :) ), and I make some music on it, too.\n\nSo, in short, my software/hardware usually are: \nSoundTracker on ZX81;\nE-Tracker on SAM Coupe computer (Spectrum Advanced Machine);\nMusicMon on ATARI 520ST;\nDigiComposer on ATARI 520ST;\nProTracker on ATARI 520 ST;\nHex-Tracker on ATARI 520ST;\nOctalyser on ATARI 1040 STE;\nOctaMED on AMIGA 500;\nDigiBooster on AMIGA 1200;\nDigital Home Studio (DHS-Tracker) on ATARI Falcon 030\nMilkyTracker on Raspberry Pi\n\n.............and many others............................\n\nYerzmyey on SoundCloud [url]https://soundcloud.com/yerzmyey/[/url]\n",
  "alive": 1,
  "deleted": 0
}
