{
  "id": 1745,
  "type": "artist",
  "handle": "Cdnalsi",
  "country": "ro",
  "real_name": "Sebastian Spanache",
  "info": "At age 24, Sebastian Spanache is one of the leaders of the next generation of up-and-coming jazz musicians in the Romanian music scene. Having performed on stages be it Romanian and International Jazz festivals, club gigs or personal projects, he always adds a fresh sound to a solid performance.\n\nSebastian started his musical journey in his home town Timisoara, Romania where he began playing the piano at age 5 and then took up the study of jazz in ninth grade while attending the National College of Arts Ion Vidu. While still studying classical piano in high school, Sebastian founded his first Jazz/Funk band later to have gigged all over Romania and win numerous prizes at student competitions.\nAfter graduating college, he started shifting his playing and compositional directions towards a more modern edge with Latin Jazz and Funk projects and gigs. While attending the National Conservatory of Timisoara, Sebastian also attended the first Jazz-Pop faculty in central-eastern Europe, the Richard Oschanitzky Faculty of Tibiscus University.\n\nSebastian has had the opportunity to play with some of the most influential Jazz musicians from Romania and abroad, and is currently pursuing the stage life of cruise ship gigging. On the East Coast of the U.S. from New York to Miami and The Bahamas, Sebastian has had several cruise ship contracts to add to his musical experience. Meeting, learning and playing with some of the most promising young musicians of the U.S., Canada, international and from the New York music scene.\nSebastian is also working on personal projects like the Merry Jazzy Christmas ‘07 CD featuring rearranged Christmas carols with a twist, along side saxophonist Lucian Nagy. His latest project, Standards, still a work in progress, is actually an effort to come back to traditional Jazz while keeping the modern feel of his playing style. Sebastian is also writing for a new trio project featuring James Cook on electric bass and Jeff Tétrault on drums.\n\nSebastian also writes music for motion pictures and video games, having projects that range from 3D Demoscene shorts like 195/95 by Plastic, PL, which won grand prize at Breakpoint Festival in Germany to freeware platform games like Within a Deep Forest and Knytt by Nicklas (Nifflas) Nygren. The games were featured on speciality websites such as JayIsGames and Gamespot.\n\nSebastian is an open-minded and versatile musician who is always ready to add his fiery style of playing to any musical situation.",
  "alive": 1,
  "deleted": 0
}
