{
  "id": 1771,
  "type": "artist",
  "handle": "Edwin van Santen",
  "country": "nl",
  "info": "Sadly, Edwin van Santen died on May 25th 2006 after a long illness. RIP, your music shall live on.\nA [url=http://20thcenturycomposers.blogspot.com/]post mortem[/url] by Falco with a lot of information about 20cc.\n\nA full copy below:\n\nIn remembrance of Edwin van Santen\nHi everyone.\n\nI don't know if many of you remember me, but Edwin and I founded 20th century composers (20cc) way back in 1988 or so. I’ve been asked to write an article focusing on Edwin’s work in 20CC, and I gladly accepted the opportunity to write about my memories of Edwin. So I’ve fired up the old SID browser and started up some of Edwin’s tracks - hoping all the good memories come back to me!\n\nBack in ’87 or so I developed a first crude version of the “music player” code (although most ideas were initially ripped from the existing Hubbard / MON players). Off course, just a player is not much use just by itself, and I was thus actively looking for someone that had some real musical talent (not having met Edwin yet). I can’t remember where and how I met Edwin, but it must have been at some copy party. Even though we had a small age gap (I was seventeen, Edwin fourteen) we immediately aligned and shared the same vision as how to proceed onwards.\n\nAs the player at that point still had a lot of rough edges (as did our SID knowledge), we decided just to start doing demo tunes and learn as we proceeded. Any careful listener can certainly hear the “crude” technology we had in the early days (just listen to one of our early tracks such as “Dolphin Force”). However, we worked hard, and did a lot of analysis on other tunes and players, and we made great progress. If you listen to “I’m your baby tonight” or “Layla mix” (both late ’88) then you will immediately notice the huge sound quality improvements we made in that first year. A special worthnoty track mentioning from these early days is the “PCW tune”, which was a huge hit in the scene. It was part of a compilation demo in order to promote ourselves among game producers on the 1988 London PCW show.\n\nFrom 1990 onwards we had the player on a very mature level, giving us ample capabilities to unleash our creativity. At that point the code had evolved from a plain rip to a program in which we had implemented a lot of our own ideas and vision (including sample playing, double speed playing, dynamic envelopes & range, auto swing, humanizing and more). Just listen to tracks such as “Scratching Zwaantjes” (’90) – the sound quality is awesome. I don’t think it gets a lot better on a SID.\n\nOverall, Edwin was the main composer, and it was my job to concentrate on the technical bits and pieces (mostly improving the music player). I was also in charge of the end mixing and sound design (though I did publish some tracks of my own).\n\nI quit the “active” scene somewhere in 1991 or so, but Edwin continued for a few more years and exited at around 1995. Listening to a track such as “Fire intro” (’93) you can definitely hear the huge improvements Edwin had made in his composing, especially when compared to some of his early tracks. Amazing how much someone can accomplish in just a few years! You’ve got to remember that Edwin had no formal musical teaching. He was basically self thought (apart from some elementary guitar playing skills he had). However, one has to note that a lot of Edwin’s family members were very musical as well. The apple apparently does not fall very far from its tree!\n\nSo let’s go back a bit in time once again, and see how 20CC evolved. Our “strategy” was to partly partner/align with well known demo/cracking groups (supplying them with exclusive tracks), and partly to release music on our own “label”. We most certainly wanted to do game music in order to make some cash and widen the audience. Unfortunally, our efforts in obtaining contracts for game music development were obstructed due to major constraints such as school, parental objections and lack of investment power ($$).\n\nSome well known / successful tunes we released in the early years were conversions from popular mainstream tracks such as “Air wolf”, “Big Fun”, “Blue Monday”, “Children Songs V2”, “Popcorn” and off course the much used “Top 40 Mega mix” (all tunes originating from 1988).\n\nSince the conversions were fun to do, and got used a lot in demo’s (boosting our fame), we decided to release a few mainstream conversions every year. This strategy seemed to work quite well for us, as we got a lot of positive feedback on these tracks (and many conversion requests). Well known releases were “Spykerhoek” (1989), “Final Axel”, “Take on me”, “I just don’t have the heart”, “Groove is in da heart” (all 1990), “Killer” (1991), “All that she wants” (1992), “Talentar bells” (aka Tubular Bells) and “This is your life” (both 1993). Another hit conversion was the Mega Mix II track, a mix of famous C64 tunes (’89).\nIf you have a spare minute, do play “Groove is in da heart” - as I think this could actually be the very best conversion ever made on a C64!\n\nBut it certainly wasn’t just conversions that we did. Some of Edwin’s best work (in my humble opinion) is to be found in tracks such as “Eternal”, “Revolution” (both ’89), “Edwin’s dream”, “Just Cool” (both ’90), “Cosmic Cyclon” (’91), “Roodkapje” (’93), “A trip into EV Space” (’94) and the before mentioned “Fire Intro”. Some of my personal favorites are “Learn it the hard way” (’90) and “Paradise” (’91) – both contain exceptional compositional work, and are very typical for his “melodic style”. My personal ever favorite track is “Somewhere Minor”, a composition in a minor scale done in 1990. The underlying chord progressions are wonderful, and the intro is extremely powerful (and again a typical signature of Edwin’s melodic movements). Looking back, it’s my personal opinion that the compositions he did in minor tone scales were among his best. Too bad there aren't many remakes of his work (see remix.kwed.org). Much of his work is definitely worth remixing…\n\nAn especially remarkable tune is the “Vlindertjes” track, an absolutely great track that was originally composed in 1988 for the PCW show demo pack. The disk with this track was stolen from Edwin on some copy party shortly after the PCW show. The tune became very well known, as it was used extensively in the “Papillion” intros - albeit in a copycat version by another author! The melody in the Papillion intro is almost identical to Edwin’s track. There is also a later remake (using a different sound set) called “Vlindertjes V2” by Edwin, done in 1990 just for fun.\n\nA good example of our partnering with demo groups is the “Sophisticated III” series of tracks. This set of seven (!) tunes was exclusively composed for the Blackmail demo group. The Sophisticated III demo had a huge impact in the scene due to the powerful combination of new coding techniques (FLI), superb graphics and music. There is also a unique loader track (with samples) where the ‘user’ may mix the tune too its own liking.\n\nSomething not many people know is that I also worked extensively with Reyn Ouwehand (as Reyn lived very close to me). Reyn used the 20CC player (with my explicit approval) and I editted a lot of his work. I hoped Reyn would one day join 20CC, but Edwin wasn’t to crazy about this idea. Reyn was the superior composer of the two (with many years of formal training and a very impressive studio), so I could understand that Edwin felt a bit threatened by Reyn… It certainly meant I had to carefully maneuver between the two talents!\nAn interesting (though also not well known) fact is that certain sound sets I created initially for Reyn were later used by Edwin in his tunes. As an example, listen to the striking resemblance between sounds and effects in Reyn’s “Super Trucker” (’91) and Edwin’s “Retteket” (same year). Edwin used the almost identical sound set I had initially developed for Reyn’s work on the Super Trucker game. Off course Reyn also used some of the sound sets I had initially created for Edwin…\n\nAfter Edwin quit the C64 scene he became a DJ / producer, mainly focusing on (hardcore) house music, working under the synonym “DJ Perpetrator”. He co-formed the “Floor Control” company, hosting four (vinyl) labels and different artists. Check out http://www.floorcontrol.com for a good overview of his later work. Some well known vinyl releases by Edwin are “Maniacs”, “The power”, “Ill Behavior”, “The Strong Survive”, “Store & Forward”, “World of Shit”, “Arena Creations”, “Come and Test Me” and “The DJ rocks”. Other highly rated releases are “Pumpin’ Correctly “, “Push em up” and “Pumpinfinity”. It’s fair to say that Edwin is generally considered one of the better early (hardcore) house producers.\n\nI learned about Edwin’s passing in the midst of june 2006. As I knew Edwin so well (teaming together to spread the 20CC sound) the news came as quite a shock to me. Edwin had most certainly been a good friend for many years. Although I lost contact with Edwin after \"growing up\", it's hard to forget him. He was a very extravert personality with a cheeky sense of humor - there was always a good laugh when you were hanging out with Edwin.\n\nHe would often call by phone just to let me hear a new tune he had been working on during the day (no email in these early days)! I can still envision the weird looks on the face of my mom when she heard the weird high pitched sounds coming from the phone! But it was quite common in these days, as Edwin always wanted to know how I felt about a tune.\n\nI can also vividly remember the many times that we were just sitting together with a little \"mini keys\" keyboard (a simple four octave kid thingy - we didn't have the cash to buy pro tools in the beginning years). Even though we had no proper gear to work with, you could still really hear the talent that he had. As said, most of the musical knowledge he had was self taught. Just imagine what would have been possible would he have had full \"formal\" musical training!\n\nAnyway, I still like to listen to his work nowadays, and not only because of sentimental reasons. Certainly, some tunes are stronger than others, but there is some very powerful material out there. I guess we may now consider this work his \"heritage\" to the scene. We should remember Edwin as a talented composer that has done so much for the progression of C64 music. Too bad he had to leave us at this young age.\n\nMy thoughts are with his family and all his many (old and new) friends.\n\nFalco (“falco.paul at gmail.com”)\n\nNote: all mentioned SID tunes are available from the HVSC, and playable with the SID player",
  "alive": 0,
  "deleted": 0
}
