{
  "id": 43031,
  "type": "song",
  "title": "Call 1-800-DEMOSCENE",
  "status": "A",
  "release_year": "2016",
  "platform_id": 1,
  "length": 235,
  "uploaded_by": "Starchaser",
  "bit_rate": 195,
  "sample_rate": 44100,
  "fav_count": 10,
  "last_requested": "2018-06-08 09:47:50",
  "locked_until": "2018-07-14 06:00:23",
  "locked": 1,
  "vote_count": 38,
  "vote_avg": 3.6579,
  "tags": "2016 coop Revision Vocals",
  "info": "2nd place in the 2016 Streaming Music compo at Revison.\n\nA mostly complete attempt at lyrics:\n--------------------------------------\nSo your day has not been great so far.\nNo seats left and all your entries are gone but your harddisk crashed.\nSo you team up for an entry, it's quite a drunk assembly, that's what you get for using Commodore.\n\n[So your day sucks? Doesn't matter. We gonna help you. Uh-huh.]\n\nCall 1-800-DEMOSCENE, in between, and you'll get lucky.\nWhat can we say we love 4k C++, and salmiakki.\n\nCall 1-800-DEMOSCENE, in between, and you'll get lucky.\nWhat can we say we love 4k C++, and salmiakki.\n\nYou can't concentrate so you walk outside for a drink or three by the fireplace you meet Abductee.\nThe bonfire gets hotta.\nYou pass out from vodka.\nWhere is everyone to get the entry done.\n\n[It don't matta. We gonna make your day. Uh-uh uh-uh.]\n\nCall 1-800-DEMOSCENE, in between, and you'll get lucky. (ohhhh)\nWhat can we say we love 4k C++, and mystic Okkie.\n\nCall 1-800-DEMOSCENE, in between, and you'll get lucky. (ohh ohhh oh ohhh)\n\nWe'll fix your file Amiga style (C++), and we got Okkie. (ohh ohhh oh ohhh)\n\n[You don't need to be dealing with this shit alone. Ain't nobody got time for dat.]\n\nYou said you would rock the compo with your funky crew.\nNow your code and shaders are overdue.\nThe deadline's coming closer you feel like a poser and you have no clue how to pull it through.\n\n[[It's always been time to call us but sure as hell it is now.]]\n\nYou got your entry finished and entered after all.\nNow you wander mindlessly around the hall.\nBut then there's an announcement your entry has bounced and Evilbot has replied: YOU'RE DISQUALIFIED.\n\n[[Oh come on now you have to call us right?]]\n\nCall 1-800-DEMOSCENE, in between, and you'll get lucky. (Lucky, lucky, lucky)\n\n[Ain't nobody got time for dat.]\n\nWhat can we say we love 4k C++, and salmiakki. (yakki, yakki)\n\nCall 1-800-DEMOSCENE, in between, and you'll get lucky.\nWe are you muses. (muses, muses)\n\nItsy bitsy teeny weeny ddt in a minikini.\nWe've heard, enough excuses.\n\n[You don't need to be dealing with this shit alone. We're in this together.]\n\n(Ahhhhh, ahhhhh)\n\n[We're in this together.]\n\n[[Call 1-800-DEMOSCENE]]\n\n[[Call 1-800-DEMOSCENE]]\n\n[[[We're sorry the number you have dialed is not in service. Please check the number and try again]]]",
  "last_scraped": "2018-06-08 11:48:28",
  "source_id": 4,
  "source": "Compo Entry",
  "artist_ids": [
    569,
    849
  ],
  "artist_names": [
    "jco",
    "Netpoet"
  ]
}
