{
  "id": 4475,
  "type": "artist",
  "handle": "M.A.F",
  "country": "Scotland",
  "real_name": "Michael Ferguson",
  "info": "Became fascinated with computer music in 1985 starting on the Spectrum 48k,I was stunned by the music of Tim Foliin and others such as Richard Joseph,who managed to make the single channel Spectrum sound like it had multiple sound channels!  Amazing!\n\nNext big thing for me was the Spectrum 128 with 3 REAL sound channels of sound to play with!  I was aware of the C64 at that time but I didn't want to admit to a friend that his Commodore 64 sounded much better than the Spectrum! I eventually heard more of the C64 soundtracks at my friends house and I was converted!\n\nI loved the sounds of the '64 and even more so,certain composers soundtracks for the games. They sounded amazing to me!\n\nI am not a musician of any kind,but from 1990 onwards,I wanted to get myself some music equipment,so I did. Teaching myself along the way without actually mastering anything,I started programming my own tunes using an Amiga connected to synthesizers and synthesizer modules via MIDI.\n\nCreated one remix of an Amiga game soundtrack in 1999 and it was submitted to AmigaRemix in 2003,also tried a remix of Last Ninja 2 Central Park Theme from the '64.\n\nAs usual for me I didn't finish it,and the effort I made now exists as an mp3 of the crap tape I recorded my demo on, complete with tape hiss galore!\n\nI continued to create music of my own as and when I could be bothered until I  eventually gave it up. .I sold all of my equipment on Ebay in 2004.(but keeping my 1200's as well as the MIDI interface just in case I changed my mind)\n----------------------------------------------------------------------------------------------------------------------------------------------------------------------------\nNew info for anyone interested.\n\nI now have many of my own original recordings using the Amiga and analogue synthesizers available for download at the below link.\n\n \n\nhttps://archive.org/search.php?query=M.A.F%20AND%20collection%3Aopensource_audio\n\n \n\nPlease take a look and have a listen.\n\n \n\nMany original Amiga modules I created are available there,as well as Amiga,C64 and Spectrum 128 game music remixes I arranged as well.All sequenced on the Amiga.\n\n\nMichael Ferguson (aka M.A.F)",
  "alive": 1,
  "deleted": 0
}
