{
  "id": 33308,
  "type": "song",
  "title": "You Can't Handle the Commodore",
  "status": "A",
  "release_year": "2009",
  "platform_id": 1,
  "length": 180,
  "uploaded_by": "hornpipe2",
  "bit_rate": 256,
  "sample_rate": 44100,
  "fav_count": 1,
  "last_requested": "2018-06-09 03:27:48",
  "locked_until": "2018-07-28 09:32:41",
  "locked": 1,
  "vote_count": 35,
  "vote_avg": 2.1429,
  "tags": "2009 Blockparty C64 Lyrics modem Rap Vocals",
  "info": "Tied for 7th place in the music compo at Blockparty '09\n\nDownload: http://www.robohara.com/?p=1424\n\nLyrics\n---\n[First Verse]\n\nListen up kid, it’s time to put down the Wiimote\nDrop the 32-bits, hop into my boat\nTalkin’ trash like a punk emcee,\nI’ll punch you in the face like the Ninja from Bruce Lee!\n\nMy kid is the son of an 8 bit,\nIn front of a sixty-four’s where I sit.\nI like to battle, but I won’t bark on,\nI’ll toast your ass like the Phoenix from Archon.\n\nI’m great at a million games man,\nWhen you were in diapers, I was cleanin up Wasteland.\nSummer Games, Winter Games, World Games, too,\nCalifornia Games cured my summertime Blues\n\nWanna play? Bring a DB9 Stick,\nI got an old Epyx that I’ll kick your ass with.\nYou want mercy? Well you better start wishin,\nYou beatin’ me’s an Impossible Mission.\n\nLike HERO, I’m about to fly,\nWith a disk notcher I’ll use your backside,\nLike Load Runner you’ll drop your load,\nThen I’ll pick up your package of gold.\n\nYou’re a headbanger, cuz you bang your drive’s head\nYou’re like a zombie, and you’re already dead,\nAnd I’m a serial killer with a serial cable,\nCuz you’re retarded, or should I say disabled?\n\nLet’s play Pitfall, you know what to do?\nWell take notes chump and I’ll give you a clue.\nJump over the logs, then swing on the vines,\nAnd then you gotta UH OH out of time!\n\nThis battle’s over, I’ve already won,\nCuz you come last like comma eight comma one.\nFeelin’ lucky? Wanna test your ability?\nYou beatin’ me? Realm of Impossibility.\n\n[Chorus]\n\nI’m the king of [the Commodore]\nYou don’t want none of [the Commodore]\nYou can’t handle [the Commodore]\n\n[Second Verse]\n\nSo bring what you got, whatchu think, you’re bad man?\nWell I got skills yo, but I ain’t Rad Man\nCuz he does art, yo and I play games, yo\nso pick up a stick and I’ll bring the pain, yo\n\nCuz here is the church and here is the steeple,\nyour only friends are Little Computer People\nIn Skate or Die you always fall,\nSo you can suck on my Wizballs\n\nI’ll cut your head off, like Barbarian\nI’m bout to school you like a librarian\nYour expectations are never gonna be met\nI’ll rip you apart like Racing Destruction Set\n\nYou think your bad, you better get your facts on,\nCuz I can rock a perfect score in Zaxxon,\nWanna play some Hacker or Hacker II,\nWell look it up bitch I wrote the walk thru.\n\nYour face is red, I can tell your pissed,\nCuz I whipped you in the Way of the Exploding Fist\nCuz I kick ass, and I never come in last,\nAnd I’ll beat your ass at Boulderdash\n\nPlayer one, player two, it just don’t matter,\nIn Karate Champ your face will splatter,\nI’ll whip you, like a goddess wearing leather\nYou can Stay a while, but don’t stay forever.\n\nIn Beach Head you took two the dome,\nYou gonna need a Space Taxi to get you home.\nYes I’m better than you, you’re not just paranoid,\nand I’m a 999 in Paradroid\n\nThree minutes and this track is through\nI’m number one and you’re 6502\nWe’re done here, and there’s the door,\nI was right, you can’t handle the Commodore.\n\n[Chorus]\n\n[Closing Comments]\n\nThat’s right, he’s the king.\nYou better run/stop your mouth.\nAw your disk is all floppy …\nHe’s got two kids — Vic, and Sid.\nHe’s gonna get you with an Isepic.\nYeah, you can’t handle the Commodore …",
  "last_scraped": "2018-06-09 05:02:02",
  "source_id": 4,
  "source": "Compo Entry",
  "artist_ids": [
    4798
  ],
  "artist_names": [
    "Flack"
  ]
}
