{
  "id": 10451,
  "type": "song",
  "title": "Discordian Thoughts",
  "status": "A",
  "release_year": "2007",
  "platform_id": 1,
  "length": 188,
  "uploaded_by": "seppjo",
  "bit_rate": 192,
  "sample_rate": 44100,
  "fav_count": 19,
  "last_requested": "2018-05-11 21:51:41",
  "locked_until": "2018-06-18 12:32:50",
  "locked": 1,
  "vote_count": 65,
  "vote_avg": 3.3692,
  "tags": "ambient Lyrics vocoder",
  "pouet_id": 31088,
  "yt_id": "3eRDg6f9UYM",
  "info": "Here are the lyrics for the parts that are not really clear. Don't try to find any poetic value in there =P (or well if you're all about it.. be my guest)\n\nI reach out my arms for the pole bolstered to my cerebrum, supporting my psyche in accord to the oblivious effects of color intoxication (FARBRAUSCH).\nA look in the construct I call my being reveals what once used to be self sufficient, now corrupt from an explosive reaction and an extravagant (STRAVAGANZA) tendency to entropy.\nAt times I crave to breach my COCOON and ascend like a wish to the constellation of ANDROMEDA to watch over the world through eyes of PLASTIC comprehending the cosmos in values of red, green, blue and transparent (RGBA).\n\nRight here on the threshold of God, I still await for the judgment of light that is fair and translucent (FAIRLIGHT), free from the torturing thoughts of CONSPIRACY theories but all I come up with are mountains of SYNESTHETIC metaphors.\nI drift on the stardust like an automobile that has lost grip and TRACTION on slippery tarmac and wonder, who will be enduring the burden of MOPPIng the dust in the belt of ORION this week..\n\nI've been feeling like a wizard that's gone mad (MADWIZARDS) and narcoleptic on an escape route paved with leaves of a BLACK LOTUS and sketches of melons (MELON DESIGN) for I never thought I'd EXCEED Ulysses expectations and reach the island of the cyclops, now unleashing new media propaganda (NUMEDIA CYCLOPS).\nRight here I stand on top of the walls of Eryx imbued by the cursed blessing of ALIEN PROPHETS to spend an eternity watching my life force being consumed by wireframe apparitions.\nI was set upon this world to try and OUTtRACK you but this is what I've become.\n",
  "last_scraped": "2018-05-23 12:29:38",
  "source_id": 2,
  "source": "Demo",
  "artist_ids": [
    44
  ],
  "artist_names": [
    "aMUSIC"
  ]
}
