{
  "id": 3852,
  "type": "artist",
  "handle": "elblanco",
  "country": "us",
  "real_name": "Mark Sanders",
  "info": "Sanders' history with music goes back to when he was 4 and saw Itzhak Perlman playing the violin. From that point on, he knew he was destined to become a violinist. At 6, his parents enrolled him in a piano school where he was selected to continue on with private lessons. At 9 he joined the local children's orchestra at his school finally getting his dream of playing the violin.\n\nHis time with the violin was a long, eventful and ultimately tragic one. While learning and developing his skills as a concert violinist, Sanders became concertmaster of three orchestras (his third and fourth year full symphonics and a selected chamber) and section leader of a fourth (Second violin, Prince William Youth Orchestra). These tenures were dramatic and culminated in 1995 with a tour of the Ural Mountain area in central Russia with a special chamber group and Quebec Province, Canada with a full symphonic. The Canadian tour ended with his orchestra winning a North American international symphonic orchestra competition where his group was the only U.S. based orchestra against a field of Canadian symphonies. He also participated in numerous trios, quartets and quintets and was guest concertmaster with a NYC based youth orchestra.\n\nDespite these successes, his final two years of schooling were met with a great deal of pain. Finally, after 1995 Sanders could no longer play the violin and suffers from chronic neck pain and a mild arthritis to this day.\n\nFortunately, in his time with the symphonies, another musical interest had grabbed his attention, tracking. Sanders first started on the music scene composing music using an early version of ModEdit around 1992. After meeting with Ryan Cramer of the legendary U.S. demo group Renaissance, he was given an early version of Composer 669 and wrote several trial using this tracker. Later he graduated to the MultiTracker tracker written by Dan \"StarScream\" Goldstein of Renaissance. For a time, he worked closely with Phil Torelle (Darkwolf) during the period when Gravis Ultra Sound GUS tracking was common. After a short time learning the various aspects of multi-channel tracking, Sanders obtained an early copy of Scream Tracker III from members of Future Crew. It was during this time that he joined Kiwidog and Primal Scream and helped to form the initial trio of the infamous U.S. demo group Terraformer.\n\nWhile a member of Terraformer, Sanders was his most prolific and produced hundreds of songs for demos (Hotel - Naid '96), intros (various), music disks (4 winds, various), games (an unpublished RPG and an unpublished racing game called Forge optioned by Bethesda Softworks) and solo releases. He grew a cult following over the years and influenced, coached (and was influenced and coached) other well known trackers such as Awesome (who later went on to make the Fast Tracker derivative Skale Tracker), LB, Vit-B, Stein, Coplan (StaticLine) and others. He also participated in numerous compos, placing consistently in the top 20. He won the Naid 96' 3channel chip tune compo with a novel 2-channel chiptune Dual Complex and placed well in the multi-channel compo. He won the '96 U.S. East-Coast Compo Retro (consisting of only U.S. based East Coast demo groups) 1-hour compo with Master of Madness and several other constrained rules compos (GC, chip, etc). ",
  "alive": 1,
  "deleted": 0
}
