{
  "id": 8695,
  "type": "song",
  "title": "All My Bitches",
  "status": "A",
  "release_year": "2002",
  "platform_id": 1,
  "length": 225,
  "uploaded_by": "seppjo",
  "bit_rate": 127,
  "sample_rate": 44100,
  "fav_count": 19,
  "last_requested": "2018-04-22 19:09:02",
  "locked_until": "2018-06-08 01:49:22",
  "locked": 0,
  "vote_count": 129,
  "vote_avg": 2.3876,
  "tags": "cringe Explicit Rap",
  "info": "\"you chumps envy my heavy and all my riches, this goes out to all my bitches!\"\n\nFrom the (never released) album \"A Little Nach Music\".  Published March 2002.\n\nDownload link:\nhttps://web.archive.org/web/20070211052111/http://virt.vgmix.com:80/music/nach/mc_nachbar_-_all_my_bitches.mp3\n\n\n???... out the style\nMC Nach is the top of the file\nMy file be packin' it with the potent information\nTalk about the ??? lovin' the masturbation\nBringin' it to you live from the top of the nation\nThinkin' my flow is gonna survive the tribulation\nFornication, precursor to relation\nThink that all your hoes like procrastination\nBitches, hear me out, y'all gotta get a clue\nI know a thing or two about a thing or two\nFinger to the moon like Bruce, yeah, the thing I'm most hell-bent\nSpittin' out rhymes with emotional content\nCall it white-fu, it's the art of the flowin'\nAbility to paraphrase the sound of bitches blowin'\nGoin' down further than the city of Atlantis\nKnowin' they ain't got shit on my antics\n\nWe got it goin' on [at five pitches?]\nWe got the funk and we're scratching all the itches\nYou chumps envy my heavy and all my riches\nThis goes out to all my bitches\n\nY'all my bitches, every last one o' you\nIn my spare time I make effort to make fun of you\nFront of you, side of you, behind your back, over you\nWhether you a Honda Civic or Ranger Rover you\nAre my bitch; all you play is ??? hoes\nNobody knows a Semite with a more hooked nose\nAnd my nose hangin' from the ceilin'\nYou bitches got ???\nYou know ??? got the feelin'\nYou know I got it goin' it on, nine to five, Tinder life, with your wife\nAnd your daughter, the ??? knife sharper than a Bowie knife\nAnd it's cuttin' through the cream with a crop\nDidn't know she was kinky and I thought she was a cop\nI guess not; ??? just for play\nHope you don't see me at the end of the day\nGotta tip for ya, home, hide the adultery\nYour bitch's tight ass is the place I wanna be\n\nWe got it goin' on...\n\nWhen they come around the bitch ??? at my cell\nAnd my two-way ??? with the true way to hell\nHell, if I'da known, I wouldn't have done her so fucking well\n'Cause I didn't know the bitch liked to kiss and tell\nShit, the gossip gets around; motherfuckers been talkin' about\nHow the bitch knew me ??? rocket\nWord hits a nigga; I'm like \"oh shit, they hitched?\"\nBut then it hits me: I'll just make *him* my bitch\nGunpoint, fun point, with the semi-automatic\n??? sayin' this shit won't be democratic\nI say \"on your knees, bitch ??? above me\"\nThen I'm like \"motherfucker, I'll fuck you till you love me\"\nTen minutes later, bitch wipin' off his chin\nThe wife bitch ??? decides to walk in\n\"Oh my God, whatcha do to my boo?\"\nI'm like \"shut your mouth, bitch, 'cause you're my bitch too\"\n\nWe got it goin' on...\n\nHeh-heh-heh, shit, I got bitches all over the place\nBitches in Mexico City, in Nebraska\nJ-Lo, she one o' my bitches\nAll the Spice Girls, they my bitches\nGeorge W. Bush, definitely my bitch\nWebster and Gary Coleman, both my bitches\nLet's see... who else?\nMadonna's my bitch, Linus Torvalds is my bitch\n??? all five of the Backstreet Boys\nCleo the psychic\nMichael George... ???\n",
  "last_scraped": "2018-06-08 01:50:43",
  "source_id": 8,
  "source": "Newschool",
  "artist_ids": [
    1741
  ],
  "artist_names": [
    "MC Nachbar"
  ]
}
