{
  "id": 18360,
  "type": "song",
  "title": "Variform (frequentform remix)",
  "status": "A",
  "length": 283,
  "bit_rate": 128,
  "sample_rate": 44100,
  "fav_count": 3,
  "last_requested": "2018-05-15 11:21:10",
  "locked_until": "2018-06-21 00:37:23",
  "locked": 1,
  "vote_count": 24,
  "vote_avg": 3.375,
  "pouet_id": 20435,
  "info": "Hello there and welcome to my first part in this musicdisk. Not only my first remix of a demotune, but also my first tune for a pc demo production.................... First of all I would like to thank the Kewlers guys for letting me contribute in this complication. It was really a pleasure to work with the samples that the original soundtrack consisted of. Easy to put into Reason and start adding melodies on top of the origial samples. . . . . . It didnt take long time from the point I started listening to the samples, until I decided to make a more \"late ninteties\" inspired tune. Based around the mainparts of the Variform track, it became the \"hard\" tune of the two I made, and is a bit more typical Ephidrena tune, compared with projects I've worked with earlier. . . . . There are some personal greets i would like to sendt out: Little Bitchard and Syntheesi of Kewlers and MFX for let me contribute to this music disk, the guys in Ephidrena that I've been working with for the last ten years (!) . . . . Everybody I met at Breakpoint this year, and past years. . . . . . and of course: the major groupgreetings: Portal process, Scarab, The Black Lotus, MFX, Kewlers, DHS, Spaceballs, Contraz, Apathy, Dcs, Rno, Farbrauch, Excess, Outracks, Lobstarrs, Progress, Inf, Nocturnal, Nature, Mystic Bytes, Mawi, Floppy, Appendix, Mankind, Loonies, Creators, Drifters, Software Failure, Kooma, Komplex, Unique, Conspiracy, Kangaroo, Bauknecht, Moods Plateau, Plastic.pl, Potion, Traktor, Tulou, Encore, Lineout, Iris, Depth, Scoopex, Evolution, Squirrels, Haujobb, Focus Design, Equinox, Agression, Addict, Mystic Norge, Darklite, Up Rough, Loveboat, promille Design, Furry boys, Team Karbis, and yes.... Those who are forgotten as well. Feel free to check out the other tune as well, or let the scroller restart..... .. .. .. ..",
  "last_scraped": "2018-05-21 11:48:41",
  "artist_ids": [
    2080
  ],
  "artist_names": [
    "Frequent"
  ]
}
