{
  "id": 35878,
  "type": "song",
  "title": "Monologue",
  "status": "A",
  "release_year": "2012",
  "platform_id": 1,
  "length": 549,
  "uploaded_by": "th4t1guy",
  "bit_rate": 269,
  "sample_rate": 44100,
  "fav_count": 32,
  "last_requested": "2018-05-14 19:46:45",
  "locked_until": "2018-06-19 17:49:43",
  "locked": 1,
  "vote_count": 82,
  "vote_avg": 3.6463,
  "tags": "2012 coop electronica FrenchSpeak lallallaa long Lyrics",
  "info": "Permission to have this song @ nectarine was given by author 2012-05-01 ( / Elrinth ).\n\n[url=http://dataairlines.bandcamp.com/album/overlander-data023]Buy album @ bandcamp[/url]\n\n-----------------------------\n\n[b]Lyrics:[/b]\nTout le monde parle de ses exploits, personne ne me parle de ses ex.\nTout le monde me parle excepté toi, à croire que tu te crois complexe.\nTout le monde parle de trucs extrêmes, mais personne n'a le bon réflexe.\nTout le monde, tu le sais toi-même, bien désolée si je te vexe.\n\nJe suis la- la- lasse, la- la- lasse, je suis la- la- la- la- lasse.\nJe suis la- la- lasse, la- la- lasse, je suis la- la- la- la- lasse.\n\nTout le monde se prend pour l'exception, personne n'accepte son échec.\nTout le monde sauf toi, pauvre con, pourquoi t'ouvres pas ton bec ?\n\nJe suis la- la- lasse de leurs histoires creuses, racontez-moi un truc pas vrai.\nJe suis la- la- lasse des biographies foireuses, toi t'insistes pour être muet !\nJe suis la- la- lasse des histoires nocturnes, racontez-moi un truc pas vrai.\nJe suis la- la- lasse des feuilletons de brunes, de rousses brûlantes et bourrées.\n\n\nTout le monde parle de ses exploits, personne ne me parle de ses ex.\nTout le monde me parle excepté toi, à croire que tu te crois complexe.\n\nJe suis la- la- lasse de vous entendre parler, racontez-moi un truc qui plait.\nJe suis la- la- lasse de toi, tout guilleret, dis-moi un truc, un truc qui plait.\nJe suis la- la- lasse des statuts à la con, de leurs soirées, du temps qu'il fait.\nJe suis la- la- lasse de cette génération, dis-moi un truc, un truc plus vrai.\n\n\n... la- la- lasse des histoires nocturnes, racontez-moi un truc pas vrai !\nJe suis la- la- lasse des feuilletons de brunes, de rousses brûlantes et bourrées.\n\nTout le monde se prend pour l'exception, personne n'accepte son échec.\nTout le monde sauf toi, pauvre con, pourquoi t'ouvres pas ton bec ?\n\nJe suis la- la- lasse de leurs histoires creuses, racontez-moi un truc pas vrai !\nJe suis la- la- lasse des biographies foireuses et toi t'insistes pour être muet !\nJe suis la- la- lasse de vous entendre parler, racontez-moi un truc qui m'plait.\nJe suis la- la- lasse de te voir, tout guilleret, dis-moi un truc, un truc qui t'plait.\n\n\nJe suis la- la- lasse des histoires nocturnes, je suis lasse des feuilletons de brunes.\nJe suis lasse, lasse, lasse de leurs histoires creuses, je suis lasse des biographies foireuses !\nJe suis la- la- lasse de vous entendre parler, je suis lasse de te voir tout guilleret !\nJe suis la- la- lasse, la- la- lasse, je suis la- la- la- la- lasse.\nJe suis la- la- lasse, la- la- lasse, je suis lasse, lasse...\nJe suis la- la- lasse, la- la- lasse, je suis la- la- la- la- lasse.\nJe suis la- la- lasse, la- la- lasse, je suis lasse, lasse...\nJe suis la- la- lasse, la- la- lasse, je suis la- la- la- la- lasse.\n\n\nVague (probably bad) translation by mirrorbird and sonix:\n\nEveryone's talking about their exploits, nobody tells me about their ex\nEveryone's talking to me except for you, as if you think you're complex\nEveryone's talking about extreme stuff, but nobody does the right thing\nEveryone, you know it yourself, sorry if I'm annoying you.\n\nI'm tired of it, tired of it...\n\nEveryone thinks they're the exception, nobody accepts [they're a loser?]\nEveryone except you, poor fucker, why don't you open your gob?\n\nI'm tired, tired, tired of their hollow stories, tell me something untrue.\nI'm tired, tired, tired of crappy biographies, you insist on keeping silent.\nI'm tired, tired, tired of hearing about people's night out, tell me something untrue.\nI'm tired, tired, tired of soap operas with brunettes and redheads on fire with booze.\n\nI'm tired, tired, tired of hearing you talk, tell me some nice stuff.\nI'm tired, tired, tired of you being so perky, tell me some nice stuff.\nI'm tired, tired, tired of fucking statuses, their nights out, what the weather's doing.\nI'm tired, tired, tired of this generation, tell me something more real.\n",
  "last_scraped": "2018-05-20 21:34:22",
  "source_id": 6,
  "source": "Commercial CD",
  "artist_ids": [
    1373,
    5044
  ],
  "artist_names": [
    "Dubmood",
    "Gem Tos"
  ]
}
