{
  "id": 22500,
  "type": "song",
  "title": "Duell der Giganten (Full Theme Edit)",
  "status": "A",
  "platform_id": 1,
  "length": 353,
  "bit_rate": 128,
  "sample_rate": 44100,
  "fav_count": 23,
  "last_requested": "2018-06-09 14:22:51",
  "locked_until": "2018-07-25 19:46:45",
  "locked": 1,
  "vote_count": 102,
  "vote_avg": 2.549,
  "tags": "GermanSpeak Lyrics Rap",
  "info": "Translated Lyrics:\n\nAnd so I tell you my story:\nIt was some time ago in the wild west,\nan unequaled and terrible fight -\nlend me your ear and I'll read it to you.\n\nOn the rocky road to nowhere\nstood two figures who aimed somewhere.\nThey wouldn't have hit each other with their weapons,\nbut there are many decisions and the path is unknown.\n\nI'll tell you the truth, no you have to experience it,\nbecause the terrain is dangerous and the road uneven,\nanyways, the two have been sleeping a long time,\nbut there came the one day when they met.\n\n[Refrain:]\nThe armies if darkness never see the twinkling,\nthe warriors of light are surfing the waves,\nthe loving truth is not like a prayer,\nit only matters who gets up first.\n\nOn the one side stood, quite unfriendly and pale,\nthe grumpy face of big bad Hate.\nHis boots glistened in the sun, sweat came through his pores.\nHe had only doubts and lost himself long ago.\n\nHe believed in the end of the world and had long been planning.\nmany people he had punished and he felt warned\nin his chest sounded with painful beats\na heart of stone, filled with questions.\n\nHe had donned glasses to protect himself from foreign eyes\nhis girlfriend in his hand, one, who doesn't hurt him\nand he kept an incessant watch\non that strange thing that watched him like an ape.\n\nOn the other side, you see, stood the Child,\nwithout a clue about life and the dangers it holds,\nit had, after due consideration of all possible choices,\ndecided to walk along the road into the horizon.\n\nHeroically it had stated: I'll walk alone,\nand after a short journey, two legs stood on the path in front of it.\nCurious, to whom these might belong, it slowly looked up\nand squinted into the barrel of a gun.\n\nThe Hate saw the Child and did not understand the form,\nhis reality distorted, his eyes abnormal,\nhe thought it a grotesque grimace, which he bore down upon,\nas he pulled the trigger with his finger.\n\n[Refrain]\n\nThe moment between the shot and the appearance of the wound\ntook not a second but rather half an hour.\nSpinning around itself, the bullet pierced the brow\nand ripped apart the neurons on its path through the brain,\nand as it exited on the other side of the head,\nthe fearless child's consciousness had scattered like leaves in the wind.\n\nThe Hate and the Destruction about which it finally knew,\nwere not the reason it had to sink down:\nThe glow of death was made to free the evil one\nfrom all doubt upon beholding it.\nMerciless and glowing, it shattered his stone heart,\nand replaced the truth of Life with that of Death.\n\nPale, the Hate sank down before the lifeless body,\nit was Truth's turn to sing him her songs.\nAfter a long time, he took off the glasses\nand saw in himself his own grave.\n\nA single tear escaped his irisless eye,\nand like a lion with a golden mane,\nthe mourning force tore apart his body:\nThe Hate had killed himself on this day.\n\nAnd the soul of the Child ventured on a journey,\nexplored the cosmos in its own way.\nWithout eyes or fingers, without mouth or ears,\nit was reborn as a small sperm cell.\n\n[Refrain]\n\n-----------\n\nOriginal Lyrics:\n\nAlso gebe ich für euch meine Geschichte zum Besten:\nEs war vor einiger Zeit im wilden wilden Westen\nein Kampf ohne Gleichen, der furchtbar gewesen -\nleiht mir euer Ohr, ich will euch alles vorlesen.\n\nAuf der steinigen Straße nach nirgendwo\nstanden zwei Gestalten und zielten nach irgendwo\nsie hätten sich mit ihren Waffen niemals getroffen \ndoch die Entscheidungen sind zahlreich und der Weg offen.\n\nIch erzähle euch die Wahrheit, nein ihr müsst sie erleben\ndenn das Gelände ist gefährlich und die Straße uneben\ndie beiden jedenfalls hatten lange Zeit geschlafen\ndoch es kam der eine Tag, an dem sich beide trafen.\n\n[Refrain:]\n\nDie Armeen des Dunkeln sehen es niemals Funkeln,\ndie Krieger des Hellen surfen auf den Wellen,\nDie liebende Wahrheit ist nicht wie ein Gebet,\nes geht nur darum wer als erster aufsteht.\n\n\nAuf der einen Seite stand, recht unfreundlich und blaß,\ndas mürrische Gesicht vom großen bösen Hass.\nSeine Stiefel glänzten in der Sonne, Schweiss drang aus den Poren.\nEr hatte nur noch Zweifel und sich selbst schon lang verloren.\n\nEr glaubte an den Untergang der Welt und hatte lang geplant\nviele Menschen hatte er bestraft und fühlte sich gewarnt\nunter seiner Brust klopfte mit peinigendem Schlagen\nein Herz aus Stein, das war angefüllt mit Fragen.\n\nEr hatte zum Schutz vor fremden Augen eine Brille aufgesetzt\nseine Freundin in der Hand, eine, die ihn nicht verletzt\nund er betrachtete mit Argusaugen und geladener Waffe\ndieses Fremde, das ihn ansah wie ein Affe.\n\nAuf der anderen Seite nämlich stand das Kind\nohne Ahnung vom Leben und welche Gefahren da sind\nes hatte nach reiflicher Überlegung aller Möglichkeiten\nbeschlossen auf der Straße in den Horizont zu schreiten.\n\nHeldenmutig hatte es gesagt: ich geh alleine,\nund nach kurzer Reise standen vor ihm auf dem Weg zwei Beine,\nneugierig wem die wohl gehörten, sah es langsam auf\nund blinzelte geblendet in einen Pistolenlauf.\n\nDer Hass sah auf das Kind und verstand nicht die Form\nseine Wirklichkeit verzerrt, seine Ansichten abnorm\ner dachte, dass er einer bösen Fratze zu Leibe rückte\nals er mit seinem Finger den Pistolenabzug drückte.\n\n\n[Refrain]\n\nDer Augenblick des Schusses bis zum Auftreten der Wunde\ndauert keine Sekunde sondern eine halbe Stunde.\nSich um sich selbst drehend durchbohrte die Kugel die Stirn\nzerfetzte alle Neuronen auf dem Weg durch das Gehirn,\nund als sie auf der anderen Seite des Kopfes den Ausgang fand\nwar das furchtlose Kindbewusstsein zerronnen wie Sand.\n\nDer Hass und die Zerstörung, um die es endgültig wusste\nwaren nicht der Grund warum es niedersinken musste:\ndas Glühen des Todes ist geschaffen um den Bösen\ndurch seinen Anblick von allen Zweifeln zu erlösen.\nErbarmungslos und leuchtend hat es sein Steinherz zerfetzt\nund für die Wahrheit des Lebens die des Todes gesetzt.\n\nBleich sank der Hass vor dem toten Körper nieder,\ndie Wahrheit war am Zug und sang ihm ihre Lieder.\nNach langer, langer Zeit nahm er die Brille ab\nund erkannte in sich selbst sein eigenes Grab.\n\nEs entkam dem Auge ohne Iris eine einzige Träne\nund wie ein goldener Löwe mit feuriger Mähne\nzerriss seinen Körper die trauernde Macht:\nDer Hass hat sich an diesem Tag selbst umgebracht.\n\nUnd die Seele des Kindes begab sich auf die Reise,\nerforschte den Kosmos auf ihre eigene Weise,\nohne Augen, ohne Finger, ohne Mund und ohne Ohren\nwurde sie als kleine Spermie wiedergeboren.\n\n[Refrain]",
  "last_scraped": "2018-06-09 16:11:07",
  "source_id": 8,
  "source": "Newschool",
  "artist_ids": [
    899
  ],
  "artist_names": [
    "Paniq"
  ],
  "requests": [
    {
      "user": "ZTube",
      "when": "2011-04-13 16:04:00"
    },
    {
      "user": "anni",
      "when": "2011-06-06 07:14:00"
    },
    {
      "user": "djrandom",
      "when": "2011-06-24 06:07:00"
    },
    {
      "user": "ZTube",
      "when": "2011-07-26 17:19:00"
    },
    {
      "user": "ZTube",
      "when": "2011-10-07 19:09:00"
    },
    {
      "user": "ZTube",
      "when": "2011-11-21 17:08:00"
    },
    {
      "user": "Robot2037",
      "when": "2012-01-17 11:11:00"
    },
    {
      "user": "ZTube",
      "when": "2012-04-26 12:38:00"
    },
    {
      "user": "anni",
      "when": "2012-06-14 19:09:00"
    },
    {
      "user": "anni",
      "when": "2012-09-03 01:01:00"
    },
    {
      "user": "MrsBidette",
      "when": "2012-10-15 02:41:00"
    },
    {
      "user": "ZTube",
      "when": "2013-01-02 09:34:00"
    },
    {
      "user": "Jeminami",
      "when": "2013-10-09 14:38:00"
    },
    {
      "user": "epso",
      "when": "2014-02-19 10:40:00"
    },
    {
      "user": "Gismo",
      "when": "2014-08-01 12:28:00"
    },
    {
      "user": "Phlubby_Gnome",
      "when": "2014-09-13 13:35:00"
    },
    {
      "user": "irishbarben_bfgnet",
      "when": "2014-11-09 15:04:00"
    },
    {
      "user": "bc2001",
      "when": "2014-12-29 14:30:00"
    },
    {
      "user": "DiGiT",
      "when": "2015-03-27 15:59:00"
    },
    {
      "user": "epso",
      "when": "2015-07-10 00:00:00"
    },
    {
      "user": "Blubber",
      "when": "2015-11-04 11:09:00"
    },
    {
      "user": "VodkaBot",
      "when": "2016-01-12 17:07:00"
    },
    {
      "user": "t3l",
      "when": "2016-02-21 11:27:00"
    },
    {
      "user": "VodkaBot",
      "when": "2016-05-30 00:36:00"
    },
    {
      "user": "anni",
      "when": "2016-07-24 11:27:00"
    },
    {
      "user": "VodkaBot",
      "when": "2016-10-02 12:38:00"
    },
    {
      "user": "VodkaBot",
      "when": "2017-01-29 10:50:00"
    },
    {
      "user": "VodkaBot",
      "when": "2017-04-10 06:05:00"
    },
    {
      "user": "VodkaBot",
      "when": "2017-08-28 12:07:00"
    },
    {
      "user": "VodkaBot",
      "when": "2018-01-12 19:27:00"
    },
    {
      "user": "VodkaBot",
      "when": "2018-03-07 11:28:00"
    },
    {
      "user": "plc",
      "when": "2018-04-23 10:23:00"
    },
    {
      "user": "plc",
      "when": "2018-06-09 14:22:00"
    }
  ]
}
