{
  "id": 16456,
  "type": "song",
  "title": "Esperenza Theme",
  "status": "B",
  "release_year": "1998",
  "platform_id": 8,
  "length": 220,
  "bit_rate": 128,
  "sample_rate": 44100,
  "fav_count": 0,
  "last_requested": "2017-12-01 00:37:08",
  "locked_until": "2017-12-23 18:56:38",
  "locked": 1,
  "vote_count": 14,
  "vote_avg": 2.7857,
  "tags": "Esperenza",
  "info": "Esperenza, message d’amour et d’espérance.\nConstruisons un nouveau monde.\nOu rien que pour toi, construisons notre nouveau monde…\n\nEsperenza, love and hope message. Let’s build a new world, let us build our new world… Beyond those words of hope i’ve written few years ago when i felt i’m loosing my girlfriend Delphine, it’s here a new chapter written for musical Cyborg Jeff life. Did you realy here such kind of music here till now ? For sure, tracks like Back to the monaster or Voyage dans sa tête, was a first step in this new direction, as opening the doors of the sounds and music world i’ve made entering at the IAD, have hearing the album of Luc Baiwir and Madradeus.\n\nBut my friend Didier Rombauts have also an important impact on those new style of music. He often played on my keyboard and with his long years of Piano, i’ve seen other way to write song and especially how a piano’s note could have a soul… With my Impulse Tracker, for now, i was now able to that.\n\nAfter long month of working on this track on my Roland E68, i’ve decided that using the MIDI recorder nor Cakewalk was enough to write that new song. So i’ve decided to sample my synthesizer with different intensity and with those sample i’ve find a new way to track musics… Now Cyborg Jeff could be a pianist !\n\nMay be Esperenza will open me new ways ? I hope so, and I realy would like this new track was the main part of my new album. That’s why i call it Esperenza too. This one should be burn in february with my friend Vivien, as my first CD Album Divagation. Remember, at that time, lot of computer don’t have CD Burner ! Anyway, i received a wonderfull gift from my friend Valentin Boigelot for my birthday few days later… My new album, recorded by himself with the perfect tracks… but without Esperenza, as at that moment, he has never heard it !! That why Esperenza Theme was not present on the eponyme album !\n\nproject : Eyes Dreams\nproject download : http://www.jamendo.com/fr/album/39547\n\n",
  "last_scraped": "2018-05-22 11:30:03",
  "source_id": 3,
  "source": "Oldskool",
  "artist_ids": [
    260
  ],
  "artist_names": [
    "Cyborg Jeff"
  ],
  "requests": [
    {
      "user": "NerdN",
      "when": "2012-03-03 22:20:00"
    },
    {
      "user": "djrandom",
      "when": "2012-11-12 04:45:00"
    },
    {
      "user": "NerdN",
      "when": "2013-02-25 08:54:00"
    },
    {
      "user": "Grit",
      "when": "2013-04-17 23:30:00"
    },
    {
      "user": "Phlubby_Gnome",
      "when": "2013-08-15 23:41:00"
    },
    {
      "user": "Neobyte",
      "when": "2013-11-19 15:36:00"
    },
    {
      "user": "Neobyte",
      "when": "2014-02-15 18:35:00"
    },
    {
      "user": "lroy",
      "when": "2016-11-18 13:11:00"
    },
    {
      "user": "Phlubby_Gnome",
      "when": "2017-12-01 00:37:00"
    }
  ]
}
