{
  "id": 2090,
  "type": "artist",
  "handle": "Lamb",
  "location": "Poznań",
  "country": "pl",
  "real_name": "Filip Skutela",
  "info": "\n\nFilip Skutela (born 1984 in Poznań, Poland) is a contemporary classical music composer, producer and a pianist. Although he had never attended any music classes or formal music education, he realized his passion for music in early childhood. Having absolute pitch, he taught himself about music theory and harmony, and composed his first music piece at the age of nine. He is self-trained pianist as well.\n\nBeing focused mainly on orchestral forms of music, he has created pieces in wide variety of classical genres; however, his compositional style represents mostly a form of neo-romanticism. During the years, Skutela evolved his own individual aesthetics and stylistics, which were being mostly described as \"longingly passionate\".\n\nUntil this time Skutela has composed three full-time symphonies (No.1 in A major - \"Spring Fireblossom\"; No.2 in C# minor - \"Moonfae\"; No.3 in Eb minor - \"The Black Key\"), two piano concertos (No.1 in E major; No.2 in B minor), two cello concertos (No.1 in E minor; No. 2 in D minor), several string quintets and quartets, of which the most notable is \"Five Elements\", as well as about 200 pieces for solo instruments, mostly piano and cello.\n\nFor many years Skutela was connected with Academy of Music in Poznań as an independent artist and performer; also collaborating with Students' Interfacultative Symphony Orchestra. He is also co-founder and conductor of Aave Chamber Orchestra as well as co-founder and musical director of Academic Choir at University of Economics and Computer Science in Warsaw.\n\nAfter winning several composition contests in 2004-2007, he became more recognized among music community and branched out into composing soundtrack scores for short-subject movies (e.g. \"Synninpäästö\", \"Menneisyys\" directed by Vuokko Salminen), theatre musical settings and other forms of art.\n\nAt the moment, he lives in Poznań and works as music composer and psychologist-therapist (having MA degree in Psychology).\n",
  "alive": 1,
  "deleted": 0
}
