{
  "id": 30246,
  "type": "song",
  "title": "That's the Shit",
  "status": "A",
  "release_year": "2010",
  "platform_id": 1,
  "length": 182,
  "uploaded_by": "Yohabro",
  "bit_rate": 185,
  "sample_rate": 44100,
  "fav_count": 12,
  "last_requested": "2018-03-07 13:41:29",
  "locked_until": "2018-04-19 18:48:38",
  "locked": 0,
  "vote_count": 80,
  "vote_avg": 2.6,
  "tags": "2010 anal Compowinner Lyrics MAiN Vocals",
  "info": "Winner of the music compo at Main 2010.\n\nLYRICS\n\nHello boys'n'girls. I'm here tonight to clean up after all the ooftza ooftza music. This song is about hip swinging and hand \nwaving, and just so that everybody out there understands, I'm gonna do this in many languages. Watch out for yours. \nJust get your hands up and your hips movin', and we're good to go. \n\nLet's go, baby, that's the shit! That's the shit! That's the shit!\nGyerünk, bébi, ez a fasza, ez a fasza, ez a fasza!\nAllez, bébé, c'est de la merde, de la merde, de la merde.\nVen, cariño, ven cari, esta bien.\n\nHabt ihr Bock?!? Dann zeigt uns'n paar Hände!\nHabt ihr Bock?!? Dann zeigt uns eure Hände!\n\nBut if that's not your thing, just go over \nand get a drink with the ladies at the bar.\nThey go, \"Ooh, vous êtes un coder? C'est magnifique!\"\nAnd your knees get weak, you can hardly speak.\nThen go to your laptop,  act like Chewbacca,\nand fix your entries for real real good.\nThis way or that, please come back\nCuz then it's on, cuz then it's on!\nCut then we get crazy down there, we get crazy up here.\nWe get totally crazy, it's just craazzeeEEEEEee!\nSo here we go!\n\nLet's go, baby, that's the shit! That's the shit! That's the shit!\nGyerünk, bébi, ez a fasza, ez a fasza, ez a fasza!\nAllez, bébé, c'est de la merde, de la merde, de la merde.\nVen, cariño, ven cari, esta bien, esta bien.\n\nHabt ihr Bock?!? Dann zeigt uns'n paar Hände!\n\nSo, jetzt lassen wir unseren Special-Freund, den Ecki Ubumbu \naus Hessisch Uganga, mal ein Bass-Solo machen.\n\nGut. So, das hätten wir. Jetzt legen wir alle noch mal schön den \nDöner weg und nehmen die Hände hoch. Ich will jetzt wirklich alle \nHände sehen, auch deine, DocD. All your hands!\n\nLet's go, baby, that's the shit! That's the shit! That's the shit!\nHelft alle mit, dass hier endlich was geht, endlich was geht, endlich was geht!\nGyerünk, bébi, ez a fasza, ez a fasza, ez a fasza!\nHände in die Lüfte und heiß gedreht, heiß gedreht, heiß gedreht.\n(Repetition)\n\nBo'i motek, ze gadol.\nMin na o ide odorou.\n\nOh, vous êtes un coder, c'est magnifique!\n\nThank you, and good night.",
  "last_scraped": "2018-05-24 11:12:44",
  "source_id": 4,
  "source": "Compo Entry",
  "artist_ids": [
    849
  ],
  "artist_names": [
    "Netpoet"
  ]
}
