{
  "id": 337,
  "type": "artist",
  "handle": "DJArtz",
  "location": "Helsinki",
  "country": "fi",
  "real_name": "Ari Pulkkinen",
  "info": "As a music and audio professional, Ari Pulkkinen has gained the deep knowledge and specialized in the field of music and sound design in game industry. His work as a composer, sound designer as well as music and audio producer has left a memorable mark in many productions and independent projects. As a side dish, Ari’s experience in game producer, designer and concept writer comes in handy along with the slick skill to produce design for trailers and in-game cinematics, including vocal directing.\n\nThe Finnish demoscene and mod tracker background was fundamental to Ari’s work. After the years of making music just as a hobby, he was hired to Frozenbyte Inc. in 2003 to make his first commercial product, Shadowgrounds (PC) game (2005) sound design and Original Soundtrack which became an instant cult classic for many gamers. For the educational point of view, diplomas in Professional audio design and producing, Further Education for Producers and Leads of the Finnish Game Industry with Adulta and Music Technology with high valued finnish institution, Sibelius Academy are the proof of talent in black and white.\n\nThe actual professional quantum leap for Ari was his five year long career as an in-house Audio Director with Frozenbyte, Inc. working as composer, sound designer and even a writer & designer with the games like Jack Claw Demo (Multiplatform) and Shadowgrounds Survivor (PC/2007) and outsourced to make the highly popular Super Stardust HD (PS3/2007). Now after 8 years of professional work in game industry, Ari has been making games likeTrine (PS3/PC), Angry Birds franchise (multiplatform), Dead Nation (PS3), Outland (PS3/360) and Bike Baron. Ari’s recently published games are Trine 2, Super Stardust Delta, Trine 2 The Goblin Menace and Angry Birds Trilogy and the latest one Resogun for PS4. These games have received rave reviews and praise for their soundtracks and sound design. Ari is currently working with various games and other really interesting projects.",
  "alive": 1,
  "deleted": 0
}
