{
  "id": 4320,
  "type": "song",
  "title": "Summer Storm",
  "status": "A",
  "release_year": "2000",
  "platform_id": 8,
  "length": 276,
  "bit_rate": 128,
  "sample_rate": 44100,
  "fav_count": 2,
  "last_requested": "2017-06-30 17:45:51",
  "locked_until": "2017-07-08 01:55:59",
  "locked": 0,
  "vote_count": 10,
  "vote_avg": 3.2,
  "info": "Hihoooo!\n\nThis is\n\n\nSUMMER STORM\n\nby\n\nMAD GOD\n\n\nHey, coming up like a heavy hurricane this tune is going to blow your\nminds.\n\nListening instructions:\n\n\nImagine yourself standing on the field with an amazing stormfront\ncoming up right next to you. You are taken away by it's power, whirled\naround and then you are able to reach the top of the clouds. Gazing at th\ne sun you approach the blue sky...\n\nOr something like that. I know I've got nothing else to do than writing\nyou some stuff like that above. But I looked at that message-window and it\nwas so empty and lonely and... but enough of that.\n\nThis tune is the result of the boring Saturday mornings, when I get up,\nstill curing the coma of the last night and the only thing I've got to do\nis to abuse my computer for tracking music. After the last two\n\"orchestra\"-XMs, I thought the time has come again to make something\nprimitive again. So I took my worst and biggest piano-sample, a really\nbad\nbasedrum and a simple beep-sample and here it is, my newest dance-track.\nOr whatever you would call that style. Well, finally composing this piece\nof music took me about one day hard and less hard work.\n\nI hope you enjoy it and we'll see what's next.\n\nI promise: the next one will be an XM again. (less channels and you don't\nhave to spend such a lot of time in reading this damn messages.)\n\n\nThat's it, MAD GOD 01-10-2000\n(e-mil: jan.streuffokay.net)\n\n-Ah yes, and don't believe in things trackers tell you who have words like\n\"MAD\" in their callsigns.\n\nCya! \n\nAs you can see, I've \nnot been idle for the \nlast few days. \n\nThis is: \n\n\"Summer Storm\" \n\nby MAD GOD \n\nwritten 08.01.2000 \nreleased 10.01.2000 \n\n\nfeel free to distribute \nthis file... \n...but please don't touch \nanything!!! \n\n\nall samples have been \nconverted to 8bit, \nbecause the original \nsize was about 5MB... \n;-) \n",
  "last_scraped": "2018-05-20 12:22:15",
  "artist_ids": [
    712
  ],
  "artist_names": [
    "Mad God"
  ]
}
