{
  "id": 9516,
  "type": "song",
  "title": "Wormsong",
  "status": "A",
  "length": 314,
  "uploaded_by": "th4t1guy",
  "bit_rate": 160,
  "sample_rate": 44100,
  "fav_count": 49,
  "last_requested": "2018-06-10 20:03:54",
  "locked_until": "2018-07-18 19:34:27",
  "locked": 1,
  "vote_count": 131,
  "vote_avg": 3.4809,
  "tags": "animal chipmunk GameRemix OutOfTune Silly Team17 worms",
  "info": "This is a story of courage, honour and worms.\n\nWar had cast a shadow over their once peaceful land, gunfire filled the air, as worm turned against worm. Where so many had fallen, others knew they must follow. For one such worm, this day had alredy come, when he was two, his father had left, never to return. Three years he had waited for his chance to fight, three years of training, both day and night. And though he was scared as he set off for battle, he knew in his heart that it was something he must do. Three inches tall, and armed to the teeth, a fine soldier he made, and his name was Boggy B.\n\n[Chorus]: We are worms, we're the best, and we've come to win the war We'll stand, we'll never run, stay until it's done Though our friends may fall, and our world be blown apart We'll strike with all our might, We'll fight for what is right till the end.\n\nScrambling up a hill and hiding behind a tree, he looked at the battle that raged below. It was there he saw his friend Spadge, stood upon a bridge but another worm had also seen him, and aimed to have him dead Boggy called to Spadge, but Spadge didn't hear, he never knew what hit him, as he flew into the air. It was all to much for Boggy, as he watched his best friend die. His heart filled with rage, and he gripped his rifle tight. Charging down the hill he had to have revenge, What had Spadge done to come to such an end? Reaching the bottom of the hill, Boggy suddenly heard a click he realised to is terror there was a mine under his tail!\n\n[Chorus]\n\nWe are worms, we're the best, and we've come to win the war We'll stand, we'll never run, stay until it's done Though our friends may fall, and our world be blown apart We'll strike with all our might, We'll fight for what is right till the end.\n\nHitting several cliffs and landing in a tree, Boggy pulled himself together, there was much he had to do. Spotting the enemy down below, he knew this was his chance. Boggy grabbed a stick of dynamite and dropped it on his head. The enemy, he tried to run, but all he could really do was squirm. As the fuse ran out there was a mighty *BANG*!, and everywhere were bits of worm. With their leader blown to kingdom come, the enemy, they turned and ran! Boggy bungeed from the tree and landed safely on the ground. As he watched the enemy squirm away, the cry went up: 'WE'VE WON THE WAR!'",
  "last_scraped": "2018-06-10 22:11:19",
  "artist_ids": [
    378
  ],
  "artist_names": [
    "Dr. Awesome"
  ]
}
