{
  "id": 35105,
  "type": "song",
  "title": "Sacrifice The Rapper",
  "status": "B",
  "platform_id": 8,
  "length": 210,
  "uploaded_by": "Spiral",
  "bit_rate": 0,
  "sample_rate": 0,
  "fav_count": 4,
  "last_requested": "2013-01-16 05:52:38",
  "locked_until": "None",
  "locked": 1,
  "vote_count": 33,
  "vote_avg": 2.2121,
  "info": "SACRIFICE THE RAPPER\n\n\nWritten, composed and recorded by Malekith in May 2000\n\n\nFor long I had wanted to make a joke-song, and when I got my new ZOOM\nGFX-707 guitar effect processor, I thought it would be an excellent\noccasion to test it :))\nSo I found the idea and wrote stupid lyrics during a philosophy class :-)\nThen, I composed this bloody shit in one hour, played and recorded it (I\nused a microphone plugged into my SB Live 128 soundcard). Finally one of\nmy friends growled the verses, and I tried to howl the chorus :))\n\nI hope you've understood this is not serious at all :)\nSo have fun with that shit !\nInspiration got from Children Of Bodom and some Cadaver stuff :)\n\nHails : Cadaver, Dragon, Hakan, HolyBlood, Darkium, Razor, ChristCrusha,\nNeomancia, and everyone who likes this :)\n\nhatemail : lordlg@hotmail.com\nICQ : 49731906\n\nMalekith's homepage : http://listen.to/malekith\n\n\n\n\n\n\nLYRICS :\n\nA primate is dancing on a computer beat,\nhis words are full of hatred, his mind is full of shit.\nSo boring and stupid, he fills our ears with crap,\nannoyed by his insults, we set him a trap.\n\nThe rapper is locked up in an unholy cave\nwith his fellows the rats, he is waiting for a grave !\nBut time has come to kill, torture and break his bones,\nwe try to smash his balls but we find out he has none !\n\n For all your crimes, you'll have to pay.\n At this point ends your bloody way...\n\n SACRIFICE THE RAPPER !\n KILL HIM NOW !\n SACRIFICE THE RAPPER !\n LET'S SPILL ALL HIS BLOOD !\n\nWith an old rusted blade, the bastard is impaled.\nOn a big wooden cross, he is finally nailed !\nWe watch him slowly die, crucified upside down\nand tied in a porker's skin, he is thrown underground !\n\n The word of violence you spread.\n By your own law you will be dead !\n\n SACRIFICE THE RAPPER !\n KILL HIM NOW !\n SACRIFICE THE RAPPER !\n LET'S SPILL ALL HIS BLOOD !\n\n",
  "last_scraped": "2018-05-23 07:59:24",
  "artist_ids": [
    5004
  ],
  "artist_names": [
    "Malekith"
  ]
}
