{
  "id": 44058,
  "type": "song",
  "title": "Party Night (Walkin' in the Park - vocals version)",
  "status": "A",
  "release_year": "1999",
  "platform_id": 1,
  "length": 329,
  "uploaded_by": "VodkaBot",
  "bit_rate": 127,
  "sample_rate": 44100,
  "fav_count": 3,
  "last_requested": "2018-05-04 20:08:55",
  "locked_until": "2018-06-24 04:02:37",
  "locked": 1,
  "vote_count": 18,
  "vote_avg": 1.7778,
  "tags": "OutOfTune Vocals",
  "info": "Lyrics: \n\nA lonely warm mid-August night, on the streets of old downtown,\nI'm watching the red-green neon lights and get lost inside the sound.\nBut I just want to take you in my arms and go dance the night away,\nso I follow the masses and drink lots of glasses and forget about today.\n\nRefrain:\n\nIt is just Party Night under the pale moon light,\nit is just Party Night and I keep on searching for you.\nIt is still Party Night under the electric light,\nit is still Party Night and I got to spend it with you.\n\nI'm walking slowly thru traffic lights and the smell of gasoline,\nI'm travelling, I'm circling subway lines to stations I've never been.\nBut I just want to keep you in my heart for the rest of all my days,\nso I follow the cars along the great boulevards and go blow my mind away!\n\n8) Yeah baby, I got to find you, on the streets of this lonely town.\nSomehow, some way, I'll get to you, tonight! 8)\n\nRefrain:\n\nIt is just Party Night under the pale moon light,\nit is just Party Night and I keep on searching for you.\nIt is still Party Night under the electric light,\nit is still Party Night and I got to spend it with you.\n\nI remember the special evening I saw your face the last time (the last time).\nYour eyes were flashing like strobo lights and love was in your smile (in your smile).\nBut I just couldn't stay, I ran away, there were other things to do (other things to do).\nFew minutes later I felt the pain inside, I couldn't sleep because of you, because of you!",
  "last_scraped": "2018-05-22 00:15:42",
  "source_id": 5,
  "source": "Remix",
  "artist_ids": [
    2711
  ],
  "artist_names": [
    "Rapture"
  ]
}
