{
  "id": 43320,
  "type": "song",
  "title": "Just Another Quick Match (in Heroes of the Storm)",
  "status": "A",
  "release_year": "2016",
  "length": 146,
  "uploaded_by": "franz_koopa",
  "bit_rate": 192,
  "sample_rate": 44100,
  "fav_count": 1,
  "last_requested": "2018-06-09 00:01:42",
  "locked_until": "2018-07-28 21:41:06",
  "locked": 1,
  "vote_count": 18,
  "vote_avg": 2.0556,
  "tags": "2016 Assembly Female FinnishSpeak Silly Vocals",
  "info": "Assembly 2016 listening music compo\n\nThe original lyrics and the translation (thanks to Kelohonka for helping with game terms)\n\n--\n\nÖhöm...\n\nKun mä avasin mun koneen, avasin myös Battlenetin ja sieltä Heroes of the Storm -kuvakkeen etin. Ja kun sen löysin, niin painoin \"play\", jonka jälkeen se peli mut täysin vei. Menin sankarivalikkoon ja halusin hyvän herran, mut rahaa se vei ja siks myös melkein otti eron, mut kultaa on pankkitilil just oikeen verran, et saan sen herran, jol haluun pelaa ainakin kerran.\n\nSitten painoin \"ready\" ja hetken odottelin. Meidän tiimin näin ja syvään hengittelin. Ei oo metaheroo, CCt, kunnon healingii. Chatti spämmää [?] venäjää, toivoa en nää. Peli kuitenkin alkoi niinkun aina ennenkin, laneille meni pelaajia ekspaa kertyikin, kunnes joku meni fiidaamaan enemyjen Xulii, ja samalla söi Kael'thaksen tuli. Venäläiset huusi \"cyka\", alkoi jahkaamaan, vihanen Rexxari taas fiidaamaan. Kuulematta peli on jo menetetty, vaikka levelii on kolme vasta kerätty. \n\nMä aloin tappaa enemmän creeppejä, otin samalla alas pari keeppiä. Enemyt huomas, etten suostu kuolemaan, ne alko sekoomaan ja yks-vee-ykkösii oottamaan, mutta yks-vee-ykköset mä aina voitan ja enemyy alko lakoo kun mä niitä muljutan. Sitten tiimiläiset tuli mua auttamaan ja sitä kautta moraalikin alkoi nousemaan. Kun supportti anto mulle nyt vielä hp:t, niin olin vielä enemmän kuin op, me voitettiin teamfightit sata-nolla ja voitto alko meille realistista olla. Lopulta me nukettiinkin alas niiden core, ja sitten aukeskin voitto-score. Meitsi oli ykkösenä kaikessa, tankkauksessa, healingissa ja damagessa.\n\n...heh, tai siis vain kuolemissa, koska tää comeback, se tapahtu vaan mun unelmissa\n\n--\n\nAhem...\n\nWhen I turned on my machine, I also opened the Battlenet and there I searched for the icon of \"Heroes of the Storm\". And when I found it, I pressed play, and after that the game totally took me. I went to the hero menu and I wanted a good mister, but it took away money and that's why I almost took a divorce, but I have gold on my account just the right amount, so I get that mister with which I want to play at least once.\n\nThen I pressed \"ready\" and waited for a moment. I saw our team and breathed deeply. There is no metahero, no CC, no proper healing. Chat spams Russian, I don't see any hope. However, the game began like always before, players went to lans, got exp, until somebody went to feeding enemy xul and bitting Kael'thas's fire at the same time. Russians shouted \"cyka\", started to procrastinate, and angry rexxar began to fade. Obviously the game is already lost, even though just three levels have been collected.\n\nI start to kill more creeps, at the same time I took down a few keeps. Enemies noticed I'm not willing to die, they started to go mad and to wait for 1V1s. But I always win 1V1s and enemies started to fall when I trash them. Then teammates came to help me and that's how also the moral started to rise. When a support gave my HPs, I was yet more OP. We won teamfight 100-0 and our victory started to be realistic. Finally we nuked their core and then a victory scores appeared. I was number one at everything: tanking, healing and damages.\n\n...heh, or really only at deaths, because this comeback, it happened only in my dreams",
  "last_scraped": "2018-06-09 01:59:41",
  "source_id": 4,
  "source": "Compo Entry",
  "artist_ids": [
    5674,
    5675
  ],
  "artist_names": [
    "calmah",
    "or4n"
  ],
  "requests": [
    {
      "user": "serpent",
      "when": "2016-08-07 18:18:00"
    },
    {
      "user": "franz_koopa",
      "when": "2016-08-15 21:05:00"
    },
    {
      "user": "NerdN",
      "when": "2016-09-07 10:49:00"
    },
    {
      "user": "Accidental",
      "when": "2016-10-07 16:46:00"
    },
    {
      "user": "Accidental",
      "when": "2016-11-11 12:57:00"
    },
    {
      "user": "Rage",
      "when": "2016-12-18 18:47:00"
    },
    {
      "user": "Accidental",
      "when": "2017-01-26 08:48:00"
    },
    {
      "user": "VodkaBot",
      "when": "2017-04-17 16:23:00"
    },
    {
      "user": "Neobyte",
      "when": "2017-10-07 15:03:00"
    },
    {
      "user": "VodkaBot",
      "when": "2017-11-17 18:29:00"
    },
    {
      "user": "Phlubby_Gnome",
      "when": "2017-12-22 14:23:00"
    },
    {
      "user": "VodkaBot",
      "when": "2018-01-19 17:31:00"
    },
    {
      "user": "VodkaBot",
      "when": "2018-02-16 16:38:00"
    },
    {
      "user": "Phlubby_Gnome",
      "when": "2018-04-13 12:58:00"
    },
    {
      "user": "VodkaBot",
      "when": "2018-06-09 00:01:00"
    }
  ]
}
